class Config:
    # URL главной страницы сервиса Яндекс.Самокат
    MAIN_PAGE_SCOOTER = 'https://qa-scooter.praktikum-services.ru/'

    # Текст ответов раздела Вопросы о важном
    ANSWER_TEXT_0 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    ANSWER_TEXT_1 = ('Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто '
                     'сделать несколько заказов — один за другим.')
    ANSWER_TEXT_2 = ('Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени '
                      'аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в '
                      '20:30, суточная аренда закончится 9 мая в 20:30.')
    ANSWER_TEXT_3 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    ANSWER_TEXT_4 = ('Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру '
                      '1010.')
    ANSWER_TEXT_5 = ('Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете '
                      'кататься без передышек и во сне. Зарядка не понадобится.')
    ANSWER_TEXT_6 = ('Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же '
                      'свои.')
    ANSWER_TEXT_7 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

    # Текст заголовка формы Заказа
    ORDER_TITLE_TEXT = 'Для кого самокат'
    # Имя
    NAME_1 = 'Алексей'
    NAME_2 = 'Витек'
    # Фамилия
    LAST_NAME_1 = 'Ландик'
    LAST_NAME_2 = 'Федоров'
    # Адрес
    ADDRESS_1 = 'Ярославль'
    ADDRESS_2 = 'Москва'
    # Телефон
    PHONE_NUMBER_1 = '+7999999999'
    PHONE_NUMBER_2 = '+7000000000'
    # Дата
    DATE_1 = '05.04.2024'
    DATE_2 = '06.04.2024'
    # Время аренды
    RENT_TIME_1 = 'трое суток'
    RENT_TIME_2 = 'четверо суток'
    # Цвет самоката
    COLOUR_1 = 'чёрный жемчуг'
    COLOUR_2 = 'серая безысходность'
    # Комментарий для курьера
    COMMENT_1 = 'Я жду тебя!'
    COMMENT_2 = 'До встречи!'
    # Статус заказа "Заказ оформлен"
    POSITIVE_ORDER_STATUS = 'Заказ оформлен'
    # Текст заголовка главной страницы
    MAIN_PAGE_TITLE_TEXT = 'Самокат'
    # URL Дзен
    DZEN_URL = 'https://dzen.ru/?yredirect=true'
